var cityList = [{
    pc: '01',
    pn: '北京',
    cs: [{cc: '0101', cn: '东城区'}, {cc: '0102', cn: '西城区'}, {cc: '0103', cn: '崇文区'}, {
        cc: '0104',
        cn: '宣武区'
    }, {cc: '0105', cn: '朝阳区'}, {cc: '0106', cn: '海淀区'}, {cc: '0107', cn: '丰台区'}, {cc: '0108', cn: '石景山'}]
}, {
    pc: '02',
    pn: '深圳',
    cs: [{cc: '0201', cn: '罗湖'}, {cc: '0202', cn: '福田'}, {cc: '0203', cn: '南山'}, {cc: '0204', cn: '盐田'}, {
        cc: '0205',
        cn: '宝安'
    }, {cc: '0206', cn: '龙岗'}]
}, {
    pc: '03',
    pn: '上海',
    cs: [{cc: '0301', cn: '宝山'}, {cc: '0302', cn: '金山'}, {cc: '0303', cn: '南市'}, {cc: '0304', cn: '长宁'}, {
        cc: '0305',
        cn: '静安'
    }, {cc: '0306', cn: '青浦'}, {cc: '0307', cn: '崇明'}, {cc: '0308', cn: '卢湾'}, {cc: '0309', cn: '松江'}, {
        cc: '0310',
        cn: '奉贤'
    }, {cc: '0311', cn: '浦东'}, {cc: '0312', cn: '杨浦'}, {cc: '0313', cn: '虹口'}, {cc: '0314', cn: '普陀'}, {
        cc: '0315',
        cn: '闸北'
    }, {cc: '0316', cn: '黄浦'}, {cc: '0317', cn: '闵行'}, {cc: '0318', cn: '徐汇'}, {cc: '0319', cn: '嘉定'}, {
        cc: '0320',
        cn: '南汇'
    }]
}, {
    pc: '04',
    pn: '重庆',
    cs: [{cc: '0401', cn: '渝中'}, {cc: '0402', cn: '江北'}, {cc: '0403', cn: '沙坪坝'}, {cc: '0404', cn: '南岸'}, {
        cc: '0405',
        cn: '九龙坡'
    }, {cc: '0406', cn: '大渡口'}]
}, {
    pc: '05',
    pn: '天津',
    cs: [{cc: '0501', cn: '和平'}, {cc: '0502', cn: '河北'}, {cc: '0503', cn: '河西'}, {cc: '0504', cn: '河东'}, {
        cc: '0505',
        cn: '南开'
    }, {cc: '0506', cn: '红桥'}, {cc: '0507', cn: '塘沽'}, {cc: '0508', cn: '汉沽'}, {cc: '0509', cn: '大港'}, {
        cc: '0510',
        cn: '东丽'
    }, {cc: '0511', cn: '西青'}, {cc: '0512', cn: '津南'}, {cc: '0513', cn: '北辰'}, {cc: '0514', cn: '武清'}, {
        cc: '0515',
        cn: '滨海'
    }]
}, {
    pc: '06',
    pn: '广东',
    cs: [{cc: '0601', cn: '广州'}, {cc: '0602', cn: '珠海'}, {cc: '0603', cn: '中山'}, {cc: '0604', cn: '佛山'}, {
        cc: '0605',
        cn: '东莞'
    }, {cc: '0606', cn: '清远'}, {cc: '0607', cn: '肇庆'}, {cc: '0608', cn: '阳江'}, {cc: '0609', cn: '湛江'}, {
        cc: '0610',
        cn: '韶关'
    }, {cc: '0611', cn: '惠州'}, {cc: '0612', cn: '河源'}, {cc: '0613', cn: '汕尾'}, {cc: '0614', cn: '汕头'}, {
        cc: '0615',
        cn: '梅州'
    }]
}, {
    pc: '07',
    pn: '河北',
    cs: [{cc: '0701', cn: '石家庄'}, {cc: '0702', cn: '唐山'}, {cc: '0703', cn: '秦皇岛'}, {cc: '0704', cn: '邯郸'}, {
        cc: '0705',
        cn: '邢台'
    }, {cc: '0706', cn: '张家口'}, {cc: '0707', cn: '承德'}, {cc: '0708', cn: '廊坊'}, {cc: '0709', cn: '沧州'}, {
        cc: '0710',
        cn: '保定'
    }, {cc: '0711', cn: '衡水'}]
}, {
    pc: '08',
    pn: '山西',
    cs: [{cc: '0801', cn: '太原'}, {cc: '0802', cn: '大同'}, {cc: '0803', cn: '阳泉'}, {cc: '0804', cn: '朔州'}, {
        cc: '0805',
        cn: '长治'
    }, {cc: '0806', cn: '临汾'}, {cc: '0807', cn: '晋城'}]
}, {
    pc: '09',
    pn: '内蒙古',
    cs: [{cc: '0901', cn: '呼和浩特'}, {cc: '0902', cn: '包头'}, {cc: '0903', cn: '乌海'}, {cc: '0904', cn: '临河'}, {
        cc: '0905',
        cn: '东胜'
    }, {cc: '0906', cn: '集宁'}, {cc: '0907', cn: '锡林浩特'}, {cc: '0908', cn: '通辽'}, {cc: '0909', cn: '赤峰'}, {
        cc: '0910',
        cn: '海拉尔'
    }, {cc: '0911', cn: '乌兰浩特'}]
}, {
    pc: '10',
    pn: '辽宁',
    cs: [{cc: '1001', cn: '沈阳'}, {cc: '1002', cn: '大连'}, {cc: '1003', cn: '鞍山'}, {cc: '1004', cn: '锦州'}, {
        cc: '1005',
        cn: '丹东'
    }, {cc: '1006', cn: '盘锦'}, {cc: '1007', cn: '铁岭'}, {cc: '1008', cn: '抚顺'}, {cc: '1009', cn: '营口'}, {
        cc: '1010',
        cn: '辽阳'
    }, {cc: '1011', cn: '阜新'}, {cc: '1012', cn: '本溪'}, {cc: '1013', cn: '朝阳'}, {cc: '1014', cn: '葫芦岛'}]
}, {
    pc: '11',
    pn: '吉林',
    cs: [{cc: '1101', cn: '长春'}, {cc: '1102', cn: '吉林'}, {cc: '1103', cn: '四平'}, {cc: '1104', cn: '辽源'}, {
        cc: '1105',
        cn: '通化'
    }, {cc: '1106', cn: '白山'}, {cc: '1107', cn: '松原'}, {cc: '1108', cn: '白城'}, {cc: '1109', cn: '延边'}]
}, {
    pc: '12',
    pn: '黑龙江',
    cs: [{cc: '1201', cn: '哈尔滨'}, {cc: '1202', cn: '齐齐哈尔'}, {cc: '1203', cn: '牡丹江'}, {
        cc: '1204',
        cn: '佳木斯'
    }, {cc: '1205', cn: '大庆'}, {cc: '1206', cn: '伊春'}, {cc: '1207', cn: '黑河'}, {cc: '1208', cn: '鸡西'}, {
        cc: '1209',
        cn: '鹤岗'
    }, {cc: '1210', cn: '双鸭山'}, {cc: '1211', cn: '七台河'}, {cc: '1212', cn: '绥化'}, {cc: '1213', cn: '大兴安岭'}]
}, {
    pc: '13',
    pn: '江苏',
    cs: [{cc: '1301', cn: '南京'}, {cc: '1302', cn: '苏州'}, {cc: '1303', cn: '无锡'}, {cc: '1304', cn: '常州'}, {
        cc: '1305',
        cn: '镇江'
    }, {cc: '1306', cn: '连云港 '}, {cc: '1307', cn: '扬州'}, {cc: '1308', cn: '徐州 '}, {cc: '1309', cn: '南通'}, {
        cc: '1310',
        cn: '盐城'
    }, {cc: '1311', cn: '淮阴'}, {cc: '1312', cn: '泰州'}, {cc: '1313', cn: '宿迁'}]
}, {
    pc: '14',
    pn: '浙江',
    cs: [{cc: '1401', cn: '杭州'}, {cc: '1402', cn: '湖州'}, {cc: '1403', cn: '丽水'}, {cc: '1404', cn: '温州'}, {
        cc: '1405',
        cn: '绍兴'
    }, {cc: '1406', cn: '舟山'}, {cc: '1407', cn: '嘉兴'}, {cc: '1408', cn: '金华'}, {cc: '1409', cn: '台州'}, {
        cc: '1410',
        cn: '衢州'
    }, {cc: '1411', cn: '宁波'}]
}, {
    pc: '15',
    pn: '安徽',
    cs: [{cc: '1501', cn: '合肥 '}, {cc: '1502', cn: '芜湖 '}, {cc: '1503', cn: '蚌埠 '}, {
        cc: '1504',
        cn: '滁州 '
    }, {cc: '1505', cn: '安庆 '}, {cc: '1506', cn: '六安 '}, {cc: '1507', cn: '黄山 '}, {cc: '1508', cn: '宣城 '}, {
        cc: '1509',
        cn: '淮南 '
    }, {cc: '1510', cn: '宿州 '}, {cc: '1511', cn: '马鞍山 '}, {cc: '1512', cn: '铜陵'}, {cc: '1513', cn: '淮北 '}, {
        cc: '1514',
        cn: '阜阳 '
    }, {cc: '1515', cn: '池州 '}, {cc: '1516', cn: '巢湖 '}, {cc: '1517', cn: '亳州'}]
}, {
    pc: '16',
    pn: '福建',
    cs: [{cc: '1601', cn: '福州 '}, {cc: '1602', cn: '厦门 '}, {cc: '1603', cn: '泉州 '}, {
        cc: '1604',
        cn: '漳州 '
    }, {cc: '1605', cn: '龙岩 '}, {cc: '1606', cn: '南平 '}, {cc: '1607', cn: '宁德 '}, {cc: '1608', cn: '莆田 '}, {
        cc: '1609',
        cn: '三明'
    }]
}, {
    pc: '17',
    pn: '江西',
    cs: [{cc: '1701', cn: '南昌'}, {cc: '1702', cn: '景德镇'}, {cc: '1703', cn: '九江'}, {cc: '1704', cn: '萍乡'}, {
        cc: '1705',
        cn: '新余'
    }, {cc: '1706', cn: '鹰潭'}, {cc: '1707', cn: '赣州'}, {cc: '1708', cn: '宜春'}, {cc: '1709', cn: '吉安'}, {
        cc: '1710',
        cn: '上饶'
    }, {cc: '1711', cn: '抚州'}]
}, {
    pc: '18',
    pn: '山东',
    cs: [{cc: '1801', cn: '济南'}, {cc: '1802', cn: '青岛'}, {cc: '1803', cn: '淄博'}, {cc: '1804', cn: '德州'}, {
        cc: '1805',
        cn: '烟台'
    }, {cc: '1806', cn: '潍坊'}, {cc: '1807', cn: '济宁'}, {cc: '1808', cn: '泰安'}, {cc: '1809', cn: '临沂'}, {
        cc: '1810',
        cn: '菏泽'
    }, {cc: '1811', cn: '威海'}, {cc: '1812', cn: '枣庄'}, {cc: '1813', cn: '日照'}, {cc: '1814', cn: '莱芜'}, {
        cc: '1815',
        cn: '聊城'
    }, {cc: '1816', cn: '滨州'}, {cc: '1817', cn: '东营'}]
}, {
    pc: '19',
    pn: '河南',
    cs: [{cc: '1901', cn: '郑州'}, {cc: '1902', cn: '开封'}, {cc: '1903', cn: '洛阳'}, {cc: '1904', cn: '平顶山'}, {
        cc: '1905',
        cn: '安阳'
    }, {cc: '1906', cn: '鹤壁'}, {cc: '1907', cn: '新乡'}, {cc: '1908', cn: '焦作'}, {cc: '1909', cn: '濮阳'}, {
        cc: '1910',
        cn: '许昌'
    }, {cc: '1911', cn: '漯河'}, {cc: '1912', cn: '三门峡'}, {cc: '1913', cn: '南阳'}, {cc: '1914', cn: '商丘'}, {
        cc: '1915',
        cn: '周口'
    }, {cc: '1916', cn: '驻马店'}, {cc: '1917', cn: '信阳'}, {cc: '1918', cn: '济源'}]
}, {
    pc: '20',
    pn: '湖北',
    cs: [{cc: '2001', cn: '武汉'}, {cc: '2002', cn: '黄石'}, {cc: '2003', cn: '十堰'}, {cc: '2004', cn: '荆州'}, {
        cc: '2005',
        cn: '宜昌'
    }, {cc: '2006', cn: '襄樊'}, {cc: '2007', cn: '鄂州'}, {cc: '2008', cn: '荆门'}, {cc: '2009', cn: '孝感'}, {
        cc: '2010',
        cn: '黄冈'
    }, {cc: '2011', cn: '咸宁'}, {cc: '2012', cn: '恩施'}, {cc: '2013', cn: '随州'}, {cc: '2014', cn: '仙桃'}, {
        cc: '2015',
        cn: '天门'
    }, {cc: '2016', cn: '潜江'}, {cc: '2017', cn: '神农架'}]
}, {
    pc: '21',
    pn: '湖南',
    cs: [{cc: '2101', cn: '长沙'}, {cc: '2102', cn: '株州'}, {cc: '2103', cn: '湘潭'}, {cc: '2104', cn: '衡阳'}, {
        cc: '2105',
        cn: '邵阳'
    }, {cc: '2106', cn: '岳阳'}, {cc: '2107', cn: '常德'}, {cc: '2108', cn: '郴州'}, {cc: '2109', cn: '益阳'}, {
        cc: '2110',
        cn: '永州'
    }, {cc: '2111', cn: '怀化'}, {cc: '2112', cn: '娄底'}, {cc: '2113', cn: '湘西 '}]
}, {
    pc: '22',
    pn: '广西',
    cs: [{cc: '2201', cn: '南宁'}, {cc: '2202', cn: '柳州'}, {cc: '2203', cn: '桂林'}, {cc: '2204', cn: '梧州'}, {
        cc: '2205',
        cn: '北海'
    }, {cc: '2206', cn: '防城港'}, {cc: '2207', cn: '钦州'}, {cc: '2208', cn: '贵港'}, {cc: '2209', cn: '玉林'}, {
        cc: '2210',
        cn: '贺州'
    }, {cc: '2211', cn: '百色'}, {cc: '2212', cn: '河池'}]
}, {
    pc: '23',
    pn: '海南',
    cs: [{cc: '2301', cn: '海口 '}, {cc: '2302', cn: '三亚'}, {cc: '2303', cn: '通什'}, {cc: '2304', cn: '琼海'}, {
        cc: '2305',
        cn: '琼山'
    }, {cc: '2306', cn: '文昌'}, {cc: '2307', cn: '万宁'}, {cc: '2308', cn: '东方'}, {cc: '2309', cn: '儋州'}]
}, {
    pc: '24',
    pn: '四川',
    cs: [{cc: '2401', cn: '成都'}, {cc: '2402', cn: '自贡'}, {cc: '2403', cn: '攀枝花'}, {cc: '2404', cn: '泸州'}, {
        cc: '2405',
        cn: '德阳'
    }, {cc: '2406', cn: '绵阳'}, {cc: '2407', cn: '广元'}, {cc: '2408', cn: '遂宁'}, {cc: '2409', cn: '内江'}, {
        cc: '2410',
        cn: '乐山'
    }, {cc: '2411', cn: '南充 '}, {cc: '2412', cn: '宜宾'}, {cc: '2413', cn: '广安'}, {cc: '2414', cn: '达川'}, {
        cc: '2415',
        cn: '巴中'
    }, {cc: '2416', cn: '雅安'}, {cc: '2417', cn: '眉山 '}, {cc: '2418', cn: '阿坝 '}, {cc: '2419', cn: '甘孜 '}, {
        cc: '2420',
        cn: '凉山 '
    }]
}, {
    pc: 'undefined',
    pn: '贵州',
    cs: [{cc: '2501', cn: '贵阳 '}, {cc: '2502', cn: '六盘水'}, {cc: '2503', cn: '遵义'}, {cc: '2504', cn: '铜仁'}, {
        cc: '2505',
        cn: '毕节'
    }, {cc: '2506', cn: '安顺'}, {cc: '2507', cn: '黔西南 '}, {cc: '2508', cn: '黔东南'}, {cc: '2509', cn: '黔南'}]
}, {
    pc: '26',
    pn: '云南',
    cs: [{cc: '2601', cn: '昆明'}, {cc: '2602', cn: '东川'}, {cc: '2603', cn: '曲靖'}, {cc: '2604', cn: '玉溪'}, {
        cc: '2605',
        cn: '昭通'
    }, {cc: '2606', cn: '思茅'}, {cc: '2607', cn: '临沧'}, {cc: '2608', cn: '保山'}, {cc: '2609', cn: '丽江'}, {
        cc: '2610',
        cn: '文山 '
    }, {cc: '2611', cn: '红河 '}, {cc: '2612', cn: '西双版纳 '}, {cc: '2613', cn: '楚雄 '}, {
        cc: '2614',
        cn: '大理 '
    }, {cc: '2615', cn: '德宏 '}, {cc: '2616', cn: '怒江'}, {cc: '2617', cn: '迪庆'}]
}, {
    pc: '27',
    pn: '西藏',
    cs: [{cc: '2701', cn: '拉萨'}, {cc: '2702', cn: '那曲'}, {cc: '2703', cn: '昌都'}, {cc: '2704', cn: '山南'}, {
        cc: '2705',
        cn: '日喀则'
    }, {cc: '2706', cn: '阿里'}, {cc: '2707', cn: '林芝'}]
}, {
    pc: '28',
    pn: '陕西',
    cs: [{cc: '2801', cn: '西安'}, {cc: '2802', cn: '铜川'}, {cc: '2803', cn: '宝鸡'}, {cc: '2804', cn: '咸阳'}, {
        cc: '2805',
        cn: '渭南'
    }, {cc: '2806', cn: '延安'}, {cc: '2807', cn: '汉中'}, {cc: '2808', cn: '榆林'}, {cc: '2809', cn: '商洛'}, {
        cc: '2810',
        cn: '安康'
    }]
}, {
    pc: '29',
    pn: '甘肃',
    cs: [{cc: '2901', cn: '兰州'}, {cc: '2902', cn: '金昌'}, {cc: '2903', cn: '白银'}, {cc: '2904', cn: '天水'}, {
        cc: '2905',
        cn: '嘉峪关'
    }, {cc: '2906', cn: '定西'}, {cc: '2907', cn: '平凉'}, {cc: '2908', cn: '庆阳'}, {cc: '2909', cn: '陇南'}, {
        cc: '2910',
        cn: '武威'
    }, {cc: '2911', cn: '张掖'}, {cc: '2912', cn: '酒泉'}, {cc: '2913', cn: '甘南 '}, {cc: '2914', cn: '临夏'}]
}, {
    pc: '30',
    pn: '青海',
    cs: [{cc: '3001', cn: '西宁'}, {cc: '3002', cn: '海东'}, {cc: '3003', cn: ' 海北 '}, {cc: '3004', cn: '黄南'}, {
        cc: '3005',
        cn: '海南'
    }, {cc: '3006', cn: '果洛'}, {cc: '3007', cn: '玉树'}, {cc: '3008', cn: '海西'}]
}, {
    pc: '31',
    pn: '宁西',
    cs: [{cc: '3101', cn: '银川'}, {cc: '3102', cn: '石嘴山'}, {cc: '3103', cn: '银南'}, {cc: '3104', cn: '固原'}]
}, {
    pc: '32',
    pn: '新疆',
    cs: [{cc: '3201', cn: '乌鲁木齐'}, {cc: '3202', cn: '克拉玛依'}, {cc: '3203', cn: '石河子'}, {
        cc: '3204',
        cn: '吐鲁番'
    }, {cc: '3205', cn: '哈密'}, {cc: '3206', cn: '和田'}, {cc: '3207', cn: '阿克苏'}, {cc: '3208', cn: '喀什'}, {
        cc: '3209',
        cn: '克孜勒苏'
    }, {cc: '3210', cn: '巴音郭楞'}, {cc: '3211', cn: '昌吉'}, {cc: '3212', cn: '博尔塔拉'}, {cc: '3213', cn: '伊犁'}]
}];